{
    "@odata.context":"https://graph.microsoft.com/Beta/$metadata#deviceAppManagement/managedAppPolicies",
    "value":[
       {
          "@odata.type":"#microsoft.graph.iosManagedAppProtection",
          "displayName":"iOS devices - Intune App Protection",
          "description":"Standard Intune Protection Policy for iOS devices",
          "createdDateTime":"2017-08-17T07:03:56.2693874Z",
          "lastModifiedDateTime":"2017-08-17T07:03:56.2693874Z",
          "id":"T_10c9d41c-5cde-49f6-8166-828f5fd3acfc",
          "version":"\"6f6966e5-27d1-4122-957b-b38f5cba640d\"",
          "periodOfflineBeforeAccessCheck":"PT12H",
          "periodOnlineBeforeAccessCheck":"PT30M",
          "allowedInboundDataTransferSources":"managedApps",
          "allowedOutboundDataTransferDestinations":"managedApps",
          "organizationalCredentialsRequired":false,
          "allowedOutboundClipboardSharingLevel":"managedApps",
          "dataBackupBlocked":true,
          "deviceComplianceRequired":true,
          "managedBrowserToOpenLinksRequired":false,
          "saveAsBlocked":true,
          "periodOfflineBeforeWipeIsEnforced":"P90D",
          "pinRequired":true,
          "maximumPinRetries":5,
          "simplePinBlocked":true,
          "minimumPinLength":4,
          "pinCharacterSet":"any",
          "allowedDataStorageLocations":[
 
          ],
          "contactSyncBlocked":true,
          "printBlocked":true,
          "fingerprintBlocked":false,
          "disableAppPinIfDevicePinIsSet":false,
          "minimumRequiredOsVersion":"10.3.2",
          "minimumWarningOsVersion":null,
          "minimumRequiredAppVersion":null,
          "minimumWarningAppVersion":null,
          "targetedSecurityGroupsCount":1,
          "targetedSecurityGroupIds":[
             "a01c11d7-2484-4e22-8f6e-20bd0ca8aa3d"
          ],
          "appDataEncryptionType":"whenDeviceLocked",
          "minimumRequiredSdkVersion":null,
          "deployedAppCount":6
       },
       {
          "@odata.type":"#microsoft.graph.androidManagedAppProtection",
          "displayName":"Android devices - Intune App Protection",
          "description":"Standard Intune Protection Policy for Android devices",
          "createdDateTime":"2017-08-18T06:22:40.0881209Z",
          "lastModifiedDateTime":"2017-08-18T06:23:38.4311218Z",
          "id":"T_2054f915-3991-4e64-a046-b07995bf4d20",
          "version":"\"855e4d77-14da-4c62-b6fb-dec239ec79e4\"",
          "periodOfflineBeforeAccessCheck":"PT12H",
          "periodOnlineBeforeAccessCheck":"PT30M",
          "allowedInboundDataTransferSources":"managedApps",
          "allowedOutboundDataTransferDestinations":"managedApps",
          "organizationalCredentialsRequired":false,
          "allowedOutboundClipboardSharingLevel":"managedApps",
          "dataBackupBlocked":true,
          "deviceComplianceRequired":true,
          "managedBrowserToOpenLinksRequired":false,
          "saveAsBlocked":true,
          "periodOfflineBeforeWipeIsEnforced":"P90D",
          "pinRequired":true,
          "maximumPinRetries":5,
          "simplePinBlocked":true,
          "minimumPinLength":4,
          "pinCharacterSet":"any",
          "allowedDataStorageLocations":[
 
          ],
          "contactSyncBlocked":true,
          "printBlocked":true,
          "fingerprintBlocked":false,
          "disableAppPinIfDevicePinIsSet":false,
          "minimumRequiredOsVersion":"5.1",
          "minimumWarningOsVersion":"6.0",
          "minimumRequiredAppVersion":null,
          "minimumWarningAppVersion":null,
          "targetedSecurityGroupsCount":1,
          "targetedSecurityGroupIds":[
             "a01c11d7-2484-4e22-8f6e-20bd0ca8aa3d"
          ],
          "screenCaptureBlocked":false,
          "disableAppEncryptionIfDeviceEncryptionIsEnabled":false,
          "encryptAppData":true,
          "deployedAppCount":6
       }
    ]
 }